In [64]:
# !pip install pyodbc#<-- iNSTALAR PYODBC

import pandas as pd
import pyodbc # <-- BOM PARA LEMBRAR PARA COLOCAR NO PORTFOLIO

In [65]:
server = 'DESKTOP-KLPI1BO\\SQLEXPRESS' # Substitua pelo nome do servidor SQL Server ***ATENÇÃO NA BARRA DUPLA
database = 'car_shop'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};' # PARA ACHAR ESSA LINHA PROCURAR EM FONTES DE DADOS ODBC E ABA DRIVERS
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando

In [66]:
dados = pd.read_excel(r"C:\Users\Luiz Krawiec\OneDrive\Documentos\portfolio\automação, implantação e EDA\excel\tbtemp_duplicados.xlsx")
#display(dados)
dados.head(5)
#display(dados)

      nome estado          cpf
0    KAMIL     MS  12345678911
1   KAMILU     MT  78945612355
2   KAMILE     SP  96385274155
3  GUSTAVA     RJ  74125896388
4   GUSTAE     RJ  36985214711

In [67]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    9 non-null      object
 1   estado  9 non-null      object
 2   cpf     9 non-null      int64
dtypes: int64(1), object(2)
memory usage: 348.0+ bytes

In [68]:
str(dados.columns).replace("'","")

'Index([nome, estado, cpf], dtype=object)'

In [69]:
cursor.execute('truncate table[tbTemp_duplicados4]')   #executa tarefa de  apagar dados
cursor.commit()

In [70]:
for index, linha in dados.iterrows():
    cursor.execute("Insert into [tbTemp_duplicados4](cpf,nome,estado)values(?,?,?)",linha.cpf,linha.nome,linha.estado) 
     # inserir colunas e quantas colunas tiver passar quantidade de ??
cursor.commit()   # validar dados no SQL Server
cursor.close()    #Fechar Cursor
conexaoDB.close() #Fechar Conexao

In [71]:
cursor.execute('delete  from [tbTemp_duplicados4]')   #executa tarefa de  apagar dados
cursor.commit()